tap "homebrew/bundle"

# package manager
brew "mise"
brew "aqua"

# development
brew "git"
brew "git-absorb"
brew "hub"
brew "ghq"
brew "neovim"
brew "peco"
brew "pngquant"
brew "jq"
brew "tree"
brew "jsonnet"
brew "folderify"

# browser
cask "dia"
cask "google-chrome"

# productivity
cask "raycast"
cask "google-japanese-ime"
cask "slack"
cask "discord"
cask "zoom"
cask "figma"
cask "google-drive"
cask "chatgpt"
cask "claude"

# container
cask "docker"
cask "orbstack"

# development applications
cask "visual-studio-code"
cask "cursor"
cask "zed"
cask "warp"
cask "sourcetree"
cask "tableplus"
