tap "homebrew/bundle"

brew "asdf"
brew "awscli"
brew "direnv"
brew "envchain"
brew "folderify"
brew "ghq"
brew "git"
brew "git-absorb"
brew "gnupg"
brew "hub"
brew "jq"
brew "neovim"
brew "peco"
brew "pinentry-mac"
brew "pngquant"
brew "tree"

cask "adobe-creative-cloud"
cask "arc"
cask "clipy"
cask "discord"
cask "docker"
cask "figma"
cask "google-drive"
cask "google-japanese-ime"
cask "graphql-playground"
cask "neat"
cask "ngrok"
cask "orbstack"
cask "raycast"
cask "sourcetree"
cask "tableplus"
cask "visual-studio-code"
cask "warp"
cask "zed"
