oh-my-fish/plugin-peco
decors/fish-ghq
jethrokuan/z
oh-my-fish/plugin-balias
oh-my-fish/plugin-expand
oh-my-fish/plugin-extract
edc/bass
0rax/fish-bd
tsu-nera/fish-peco_recentd
tsu-nera/fish-peco_open_gh_repository
yoshiori/fish-peco_select_ghq_repository
oh-my-fish/theme-bobthefish
